Revit 2026 API

# RebarShapeTerminationsData Constructor

---

Creates a new instance of RebarShapeTerminationData with the default values.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public RebarShapeTerminationsData(
	Document document
)
```
```vb
Public Sub New (
	document As Document
)
```
```cpp
public:
RebarShapeTerminationsData(
	Document^ document
)
```
```fsharp
new :
        document : Document -> RebarShapeTerminationsData
```

#### Parameters

document Document
     The document containing the end treatment ids.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

RebarShapeTerminationsData Class

Autodesk.Revit.DB.Structure Namespace